IDEA StatiCa Open Model
LineLoad.BegPositionX Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 point support position X
 Namespace: IdeaRS.OpenModel.Detail.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double BegPositionX { get; set; }
Public Property BegPositionX As Double
	Get
	Set
public:
property double BegPositionX {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
LineLoad Class
IdeaRS.OpenModel.Detail.Loading Namespace